Repository: yusheng0625/messaging-libp2p-rust
Catalog: qaul_ui/lib/l10n/app_*.arb
Languages: ar

# languageName
source: English
ar: اللغة العربية

# createAccountHeading
source: Choose a user name
ar: نص بسيط

source: Start
ar: بداية

# createUserAccount
source: Create user profile
ar: إنشاء ملف تعريف المستخدم

# learnMore
source: Learn about qaul.net
ar: تعرف على موقع qaul.net

# okDialogButton
source: OK
ar: نص بسيط

# cancelDialogButton
source: CANCEL
ar: نص بسيط

# backButtonTooltip
source: Back
ar: نص بسيط

# sendTooltip
source: Send
ar: نص بسيط

# sendFileTooltip
source: Send File
ar: إرسال ملف

# userAccountNavButtonTooltip
source: Your account
ar: نص بسيط

# publicNavButtonTooltip
source: Public
ar: نص بسيط

# usersNavButtonTooltip
source: Users
ar: نص بسيط

# chatNavButtonTooltip
source: Chat
ar: نص بسيط

# netNavButtonTooltip
source: Network
ar: نص بسيط

# createPublicPostTooltip
source: Create post
ar: نص بسيط

# submitPostTooltip
source: Submit
ar: نص بسيط

# newChatTooltip
source: New chat
ar: نص بسيط

source: Settings
ar: نص بسيط

source: About
ar: نص بسيط

source: Theme
ar: نص بسيط

source: Light Theme
ar: نص بسيط

source: Dark Theme
ar: نص بسيط

source: Internet Nodes
ar: نص بسيط

source: Address
ar: نص بسيط

source: Name
ar: نص بسيط

source: Connections
ar: نص بسيط

# allConnectionsFilterLabel
source: Show Entire Network
ar: عرض الشبكة بالكامل

source: Ping
ar: نص بسيط

source: Hop Count
ar: نص بسيط

source: Via
ar: نص بسيط

source: Language
ar: نص بسيط

source: Username
ar: نص بسيط

source: User ID
ar: نص بسيط

source: Public Key
ar: نص بسيط

source: Unknown
ar: نص بسيط

source: Verify
ar: نص بسيط

# unverify
source: Remove verified status
ar: نص بسيط

source: Block User
ar: نص بسيط

source: Unblock User
ar: نص بسيط

# addNodeCTA
source: Add internet node
ar: نص بسيط

# chatEmptyMessageHint
source: Your message...
ar: نص بسيط

# emptyPublicList
source: No public messages yet
ar: نص بسيط

# emptyUsersList
source: No users added yet
ar: نص بسيط

# emptyChatsList
source: No chat rooms yet
ar: نص بسيط

# verifyUserConfirmationMessage
source: Do you want to verify this user?
ar: نص بسيط

# unverifyUserConfirmationMessage
source: Do you want to remove the verified status from this user?
ar: نص بسيط

# blockUserConfirmationMessage
source: Do you want to block this user?
ar: نص بسيط

# unblockUserConfirmationMessage
source: Do you want to unblock this user?
ar: نص بسيط

# useSystemDefaultMessage
source: Use system's default
ar: نص بسيط

# genericErrorMessage
source: An error occurred
ar: نص بسيط

# fieldRequiredErrorMessage
source: Field required.
ar: نص بسيط

# timeoutErrorMessage
source: Timeout
ar: نص بسيط

# notFoundErrorMessage
source: not found
ar: نص بسيط

# noneAvailableMessage
source: None available
ar: نص بسيط

# invalidIPMessage
source: Invalid IP
ar: نص بسيط

# invalidPortMessage
source: Invalid Port
ar: نص بسيط

# usernameLengthMessage
source: Username must have at least 2 characters.
ar: يجب أن يتكون اسم المستخدم من حرفين على الأقل.

# publicNotificationsEnabled
source: Enable/Disable Public posts Notifications:
ar: تمكين / تعطيل إشعارات الخلاصة:

# chatNotificationsEnabled
source: Enable/Disable Chat Notifications:
ar: تمكين / تعطيل إشعارات الدردشة:

# notifyOnlyForVerifiedUsers
source: Only Show Verified Notifications:
ar: إظهار الإخطارات التي تم التحقق منها فقط:

# createGroupHint
source: Group name
ar: أسم المجموعة

# genericEmptyState
source: Nothing here yet
ar: لا شيء هنا حتى الآن

# pleaseRestartApp
source: Please restart the application
ar: الرجاء إعادة تشغيل التطبيق

source: Go to support
ar: اذهب إلى الدعم

# continueDialogButton
source: Continue
ar: يكمل

source: Remove user
ar: إزالة المستخدم

# removeUserDialogContent
source: Are you sure you'd like to remove this user from the group?
ar: هل أنت متأكد أنك تريد إزالة هذا المستخدم من المجموعة؟

source: Support
ar: الدعم

source: Enable Logging:
ar: تمكين التسجيل:

source: Total logs size:
ar: الحجم الإجمالي للسجلات:

source: Delete logs
ar: حذف السجلات

# logsDescription1
source: Whenever an error occurs, a log is created.
ar: عند حدوث خطأ ، يتم إنشاء سجل.

# logsDescription2
source: You can choose to report them or delete them.
ar: يمكنك اختيار الإبلاغ عنها أو حذفها.

source: Send Logs
ar: إرسال سجلات

source: No Logs Available
ar: لا توجد سجلات متاحة

source: Routing Data Table
ar: جدول بيانات التوجيه

# addIPv6NodeCTA
source: Add IPv6 Node
ar: أضف عقدة IPv6

source: Known Addresses
ar: العناوين المعروفة

source: No open chats
ar: لا توجد محادثات مفتوحة

source: Group Invite
ar: دعوة المجموعة

source: Create new group
ar: إنشاء مجموعة جديدة

source: Invite
ar: يدعو

source: Group Name
ar: أسم المجموعة

source: Created at
ar: أنشئت في

# noOfMembers
source: Number of members
ar: عدد من أعضاء

source: Invited by
ar: بدعوة من

source: Accept
ar: قبول

source: Decline
ar: انخفاض

source: Group Settings
ar: إعدادات المجموعة

source: Members
ar: أعضاء

source: Show All Files
ar: إظهار كافة الملفات

source: Search user...
ar: بحث عن مستخدم ...

source: DTN Nodes
ar: عقد DTN

source: Add user node
ar: أضف عقدة المستخدم

# publicNoteHintText
source: Public note
ar: ملاحظة عامة

# createButtonHint
source: Create
ar: خلق

# chatEmptyState
source: No messages here yet
ar: لا توجد رسائل هنا حتى الآن

source: Security Number
ar: رقم سرى

# securityNumberDialogDesc
source: Please ensure that the person you're trying to verify sees the same security number on their screen when attempting to verify you.
ar: يرجى التأكد من أن الشخص الذي تحاول التحقق منه يرى نفس رقم الأمان على شاشته عند محاولة التحقق منك.

# groupStateEventCreated
source: The group has been created
ar: تم إنشاء المجموعة

# groupStateEventClosed
source: The group has been closed
ar: تم إغلاق المجموعة
